app/controllers/avaliacao_controller.rb

SELECT * FROM "palestras" WHERE ("palestras"."id" = 1)
---
  def new
    @palestra = Palestra.find(params[:palestra_id])

SELECT * FROM "palestras" WHERE ("palestras"."id" = 1)
INSERT INTO "avaliacaos" ("comentario", "created_at", "avaliador_id", "updated_at", "valor", "palestra_id") VALUES('', '2011-06-30 22:10:51', NULL, '2011-06-30 22:10:51', NULL, 1)
---
  def create
    @palestra = Palestra.find(params[:palestra_id])
    @avaliacao = Avaliacao.new(params[:avaliacao])
    @avaliacao.palestra = @palestra

    if @avaliacao.save