app/controllers/palestras_controller.rb

  def index
    @palestras = Palestra.all
---
SELECT * FROM "palestras" ORDER BY data DESC, horario ASC

  def show
    @palestra = Palestra.find(params[:id])
---
SELECT * FROM "palestras" WHERE ("palestras"."id" = 1)

  def rate
    @palestra = Palestra.find(params[:id])
    @rating = Rating.new(params[:rating])
    @rating.palestra = @palestra
    @rating.save
---
SELECT * FROM "palestras" WHERE ("palestras"."id" = 1)
INSERT INTO "ratings" ("comentario", "created_at", "identificacao", "updated_at", "rate", "palestra_id") VALUES(NULL, '2011-06-29 21:21:23', NULL, '2011-06-29 21:21:23', 0, 1)

  def create
    @palestra = Palestra.new(params[:palestra])

    respond_to do |format|
      if @palestra.save
---
INSERT INTO "palestras" ("data", "created_at", "updated_at", "horario", "palestrante") VALUES('2011-06-29', '2011-06-29 20:05:56', '2011-06-29 20:05:56', '2011-06-29 20:05:00', 'BLag')